{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi there",
        "How are you",
        "Is anyone there?",
        "Hey",
        "Hola",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hello, what can i do for you?",
        "Hi there, how can I help?"
      ],
      "context": [""]
    },
     {
      "tag": "get_info",
      "patterns": [
        "Tell me about the North Central Province",
        "What can I do in the North Central Province?",
        "What are some attractions in the North Central Province?",
        "I want to learn more about the North Central Province"
      ],
      "responses": [
        "The North Central Province of Sri Lanka is known for its rich history and cultural heritage. You can visit the ancient city of Anuradhapura, the ruins of Polonnaruwa, or the majestic Sigiriya rock fortress. There are also many national parks and wildlife reserves in the area, such as Minneriya National Park and Wilpattu National Park. \\n More Info: <a href=\\\"https://www.bing.com/maps?q=north+central+province&FORM=HDRSC7&cp=8.335354%7E80.410111&lvl=9.8/\\\">Show on Google Map</a> \n Let me know if you have any other questions!"
      ],
      "context": [""]
    },
    {
      "tag": "get_directions",
      "patterns": [
        "How do I get to the North Central Province?",
        "What's the best way to travel to the North Central Province?",
        "Can you give me directions to the North Central Province?"
      ],
      "responses": [
        "The North Central Province is located in the northern part of Sri Lanka. The easiest way to get there is by car or bus from Colombo, the capital city. There are also flights to nearby cities such as Anuradhapura or Sigiriya. Once you arrive, there are many local transportation options available to get around the area. \\n More Info: <a href=\\\"https://www.bing.com/maps?q=north+central+province&FORM=HDRSC7&cp=8.335354%7E80.410111&lvl=9.8/\\\">Show on Google Map</a>"
      ],
      "context": [""]
    },
    {
      "tag": "find_accommodation",
      "patterns": [
        "Where can I stay in the North Central Province?",
        "What are some good hotels in the area?",
        "I need a place to stay in the North Central Province"
      ],
      "responses": [
        "There are many accommodation options available in the North Central Province, ranging from budget guesthouses to luxury hotels. Some popular options include the Cinnamon Lodge Habarana, Jetwing Vil Uyana, and Ulagalla Resort. Let me know if you need help making a reservation or finding a specific type of accommodation. \\n More Info: <a href=\\\"http://bitly.ws/DUof/\\\">Visit Google</a>"
      ],
      "context": [""]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye",
        "Nice chatting to you, bye",
        "Till next time"
      ],
      "responses": [
        "Thanks for chatting with me! Enjoy your visit to the North Central Province of Sri Lanka.",
        "Take care and have a great time in the North Central Province!",
        "Goodbye! Don't hesitate to contact me again if you need further assistance."
      ],
      "context": [""]
    },
    {
      "tag": "food_and_drinks",
      "patterns": [
        "Where can I find good food in the North Central Province?",
        "What are some local dishes I should try?",
        "I'm hungry, where should I go to eat?"
      ],
      "responses": [
        "The North Central Province is known for its unique cuisine, which includes dishes such as kottu roti, hoppers, and string hoppers. Some popular restaurants in the area include the Habarana Village by Cinnamon, The Lake Hotel Polonnaruwa, and Athula's Kitchen. Let me know if you need help making a reservation or finding a specific type of cuisine."
      ],
      "context": [""]
    }
  ]
}
